In [26]:
import pandas as pd
import numpy as np

In [27]:
#generating random data
np.random.seed(1)
data = {
    "ID":np.arange(1,1001),
    "First_name":np.random.choice(["cornelius", "samantha", "nelius", "John", "peter"], size = 1000),
    "Last_name":np.random.choice(["don", "tish", "nyamweya", "omondi", "mbugua",], size = 1000),
    "Gender":np.random.choice(["M", "F"], size = 1000),
    "Age":np.random.randint(16, 45, size = 1000)
}

In [28]:
df = pd.DataFrame(data )
print(df.sample(10))

      ID First_name Last_name Gender  Age
596  597   samantha      tish      F   43
871  872       John       don      M   28
520  521  cornelius      tish      M   36
823  824   samantha    omondi      M   44
124  125   samantha  nyamweya      M   37
62    63       John       don      F   33
897  898       John      tish      M   25
226  227   samantha    mbugua      M   16
459  460     nelius    omondi      F   19
121  122     nelius    omondi      M   24

In [29]:
#the select statement
query = """
SELECT First_name, Last_name, Age
FROM df
"""

result = sqldf(query)
print(result.sample(5))

    First_name Last_name  Age
459     nelius    omondi   19
782     nelius    omondi   37
728     nelius       don   22
445   samantha  nyamweya   41
795       John  nyamweya   23

In [30]:
#where
query = """
SELECT *
FROM df 
WHERE age <30 AND Gender = "M" 
"""
result = sqldf(query)
print(result.sample(5))

      ID First_name Last_name Gender  Age
42   214  cornelius       don      M   26
113  524      peter    mbugua      M   21
17    91      peter    mbugua      M   26
119  549      peter       don      M   26
21   119     nelius    mbugua      M   26

In [31]:
query = """
SELECT *
FROM df 
WHERE age >10 AND last_name = "mbugua"
"""
result = sqldf(query)
print(result.sample(5))

     ID First_name Last_name Gender  Age
96  515      peter    mbugua      F   33
79  413  cornelius    mbugua      F   28
38  218  cornelius    mbugua      F   44
82  423       John    mbugua      M   18
39  220      peter    mbugua      M   24

In [43]:
#group by
query = """
SELECT Gender as GD
FROM df 
GROUP BY Gender 
"""
result = sqldf(query)
print(result)

  GD
0  F
1  M

In [37]:
query = """
SELECT Age as A
FROM df 
GROUP BY Gender 
"""
result = sqldf(query)
print(result.head())

    A
0  34
1  16

In [42]:
import pandasql import sqldf
#order by 
query = """
SELECT First_name, Last_name , Age 
FROM df 
ORDER BY  First_name desc, Last_name desc
"""
result = sqldf(query)
print(result.head())

  First_name Last_name  Age
0   samantha      tish   28
1   samantha      tish   37
2   samantha      tish   38
3   samantha      tish   40
4   samantha      tish   25

In [52]:
# join 
# creating a second dataframe
np.random.seed(2)
data2 = {
    "ID":np.arange(1, 1001),
    "city":np.random.choice(["kisumu", "nairobi", "mombasa", "eldoret","nakuru"], size = 1000),
    "country":np.random.choice(["kenya", "uganda", "tanzania", "rwanda", "burundi"])
    
}
df2 = pd.DataFrame(data2)

In [76]:
#inner join
query = """
SELECT df.[ID], df.[First_name], df.[Last_name], df2.[city]
FROM df
INNER JOIN df2 ON df."ID" = df2."ID"
"""
result = sqldf(query)
print(result.head())

   ID First_name Last_name     city
0   1       John       don   kisumu
1   2      peter  nyamweya   kisumu
2   3  cornelius      tish  eldoret
3   4   samantha  nyamweya  mombasa
4   5       John    omondi  eldoret

In [ ]:
#right join
query = """
SELECT df.[ID], df.[First_name], df.[Last_name], df2.[city]
FROM df
RIGHT JOIN df2 ON df."ID" = df2."ID"
"""
try:
    result = sqldf(query)
    print(result.head())